import django_setup
from school_manager import *


print(
    r"""
                         /$$                           /$$                                       /$$                         /$$
                        | $$                          | $$                                      | $$                        | $$
      /$$$$$$$  /$$$$$$$| $$$$$$$   /$$$$$$   /$$$$$$ | $$        /$$$$$$$  /$$$$$$  /$$$$$$$  /$$$$$$    /$$$$$$   /$$$$$$ | $$
     /$$_____/ /$$_____/| $$__  $$ /$$__  $$ /$$__  $$| $$       /$$_____/ /$$__  $$| $$__  $$|_  $$_/   /$$__  $$ /$$__  $$| $$
    |  $$$$$$ | $$      | $$  \ $$| $$  \ $$| $$  \ $$| $$      | $$      | $$  \ $$| $$  \ $$  | $$    | $$  \__/| $$  \ $$| $$
     \____  $$| $$      | $$  | $$| $$  | $$| $$  | $$| $$      | $$      | $$  | $$| $$  | $$  | $$ /$$| $$      | $$  | $$| $$
     /$$$$$$$/|  $$$$$$$| $$  | $$|  $$$$$$/|  $$$$$$/| $$      |  $$$$$$$|  $$$$$$/| $$  | $$  |  $$$$/| $$      |  $$$$$$/| $$
    |_______/  \_______/|__/  |__/ \______/  \______/ |__/       \_______/ \______/ |__/  |__/   \___/  |__/       \______/ |__/
    """
)

while True:

    user = input(
        """                          0 - вийти
             1 - додавання предмету
              2 - додавання вчителя
                3 - додавання класу
                 4 - додавання учня
              5 - додавання заняття
               6 - додавання оцінки
                               >> """
    )

    if user == "0":
        break
    elif user == "1":
        add_subject()
    elif user == "2":
        add_teacher()
    elif user == "3":
        add_class()
    elif user == "4":
        add_student()
    elif user == "5":
        add_schedule()
    elif user == "6":
        add_grade()

